export default {
  startGame: {
    btns: ["为了孩子", "为了拯救人类", "为了感恩"],
    enterTitle: ["你决定彻底消灭ACG文化", "走上一条不被世界理解的道路"],
    enterTitle1: [
      "你在大街上开始拦住路人宣讲、去图书馆演讲……",
      "你大喊消灭ACG暴政，世界属于孩子！",
    ],
    enterTitle2: [
      "大城市ACG文化氛围太浓，垄断的文娱公司和被收买的无良媒体让你四处碰壁",
      "你决定从从农村包围城市，先回到了老家",
    ],
  },
  endGame: {
    fail: "游戏失败了，世界各地都被ACG文化影响，你再也无法杀死ACG了！<br>现在将进入多周目，根据你当前信徒的数量，你将会获得一种稀有的资源——政治背景！祝你投个好胎",
    success: "世界各地都的ACG文化都被你消灭了，这个世界回归平静<br>你的心里充满了感恩和光明。游戏胜利了！<br>你也可以继续重置，挑战更快的速度通关",
  },
  workTips:"使用Crtl、Shift、Alt组合键，一次转移10、25、100倍\n多个组合键效果叠加\n选择按百分比转移时无效",

  news: [
    "XX游戏公司宣布：因放假调休，本周六未成年人8点到9点无法进入游戏。",
    "XX视频网下架了一批不合规的动漫，群众纷纷鼓掌叫好",
    "全国人民喜迎游戏版号新政策！",
    "XX通知宣布，正在研究人脸识别的未成年人防沉迷效果，为未成年人保驾护航。",
    "□□词，□口，信仰□□，□股，□□□□□□□□□□",
    "XX日报发文：Steam注册流程存在漏洞，无严格身份验证",
    "XX游戏公司公布统计数据：未成年人每周六晚8点有序排队进入游戏，一般8点50分可以陆续进入。",
    "某消保委发布调查报告，称 21 部动画查出 1465 个问题点",
    "某工委发布网络游戏行业防沉迷自律公约，抵制通过境外游戏平台向国内用户提供服务等行为",
    "XX署下发关于进一步严格管理 切实防止未成年人沉迷网络游戏的通知,各大游戏公司积极响应拍手叫好",
    "媒体报道：主机游戏不限时，单机游戏缺监管！如何防小玩家钻空子",
    "X视批评《喜羊羊与灰太狼》和《熊出没》等高人气动画内容暴力低俗",
  ],

  guideTips: [
    "解锁了金钱，金钱主要用于购买各项建筑以及研究ACG相关的知识\n钱不是目的，只是手段，金钱对你来说如同粪土\n你只是为了消灭ACG文化才收集了一点点钱",
    "解锁了动漫知识，这是一种研究资源\n在研究分页内，解锁各项研究，加速你消灭ACG的进程\n知己知彼百战百胜，我不入地狱谁入地狱",
    "你解锁了第一个信徒建筑，信徒是一群彻底追随你消灭ACG的助手，会帮你扩大影响力\n前往小镇建设心理诊所获得信徒",
    "在工作面板分配信徒工作，可以扩大影响力、赚取金钱和研究知识。\n每名信徒可提供1点影响力、2点金钱或者1点知识的速度（研究知识会消耗2倍的金钱）\n信徒的增长速度受自身数量影响",
    "你解锁了印刷店，这是一种金钱效率建筑\n每个印刷店会提高信徒10%的赚取金钱效率",
    "你解锁了书店，这是一种研究效率建筑\n与印刷店一样，它会提高10%的研究动漫知识的效率",
    "你来到新的电力时代，网瘾治疗中心，这将提供一种新的伪信徒——从众\n从众没有信徒虔诚，他们不会主动去消灭ACG文化，但会被动的跟随信徒活动\n从众不会提高你的影响力上限。但你可以安排他们工作，每个从众需要额外消耗1点金钱每秒\n从众的增长速度和信徒的增长速度一样，当信徒达到上限后，从众将获得两倍的增长速度",
    "你解锁了游戏知识，这是另一种ACG文化\n游戏的荼毒更深，所以需要深入研究\n每1点游戏知识需要消耗10点金钱，且只能通过信徒/从众工作获取",
    "你解锁了举报功能！\n举报是一项伟大的发明，将那些看不顺眼的ACG文化通通举报吧！至于对错Who care!\n举报成功会降低ACG文化影响力，并获得影响力1%的金钱（受金钱加成效率影响）",
    "你解锁了政策点，这是一种高级资源\n政策点消耗大量的基础资源，可以在政策界面推行各种新政策\n政策可以一直升级来提高政策的效果\n与其类似的是政策界面的法案，它需要消耗政治背景\n你可以通过政策界面，进入下周目的按钮来重置游戏，来获取政治背景",
    "ACG文化正在对世界造成影响，在游戏最上方的进度条可以查看详细信息\n当ACG文化的影响达到满值时，游戏将自动重置（你也可以在解锁高级功能政策后手动重置)\n当ACG文化的影响值归零时，代表彻底杀死了ACG，游戏将取得最终胜利"
  ],

  //举报分类型，0是错误 123国内漫画动漫游戏456国外漫画动漫游戏;789外太空的漫画;9外太空的动漫；10外太空的游戏
  complain: [
    [
      "错误的举报,你惹到了一些你惹不起的人物。",
      "错误的举报,你惹到了一些你惹不起的人物。",
      "错误的举报,你惹到了一些你惹不起的人物。",
      "错误的举报,你惹到了一些你惹不起的人物。",
      "错误的举报,你惹到了一些你惹不起的人物。",
    ],
    [
      "这本国内漫画是对日本的肤浅模仿。",
      "你发现一本国内漫画的道德体系不对，感受不到作为一个人的道德感。",
      "这本国内漫画的舰娘文化太重，影响了青少年。",
    ],
    [
      "这部国产动漫是在歪曲历史，哗众取宠。",
      "你发现一部国产动漫是过度美化他国历史。",
      "这部国产动漫的善恶观念被模糊，表现太多历史的阴暗面。",
      "你发现一部国产动漫有太多的耽美因素，需要整改。",
    ],
    [
      "国内游戏的修仙题材太多，同质性严重。修仙并不是传统文化的代表。",
      "你发现一款国产用了太多击杀、射杀、杀死等词语",
      "这款国产游戏的敏感词不完善，提示不规范，领导人的名字怎么能提示非法呢。",
      "这款国产游戏防沉迷做的不完善，9点钟没有强制登出未成年。",
      "这款国产游戏设置了违背社会公德的系统或玩法。",
      "这款国产游戏存在双修（修仙）、结婚生子。",
    ],
    [
      "这本国外漫画意识形态不对，需要整改。",
      "你发现一本国外漫画价值观有问题。",
      "这本国外漫画讲的故事发生在一些敏感地区，不适合引入。",
    ],
    [
      "这部国外动漫可以宣传男男CP，死灰复燃。",
      "你发现了一部国外动漫将历史人物娘化。",
      "你发现了一部国外动漫修改了历史进程。",
    ],
    [
      "这款国外游戏的血腥暴力成分太多了。",
      "这款国外游戏首领用了BOSS的英文单词，需要整改。",
      "这款国外游戏有太多宗教元素，带来了不好的影响。",
    ],
    [
      "这本外太空漫画里面□□□□□□□□□□",
      "这本外太空漫画□□□□□□□□",
      "你发现了一本外太空漫画□□□□□□□□□□",
    ],
    [
      "这部外太空动漫□□□□□□□□□□□□□□□□□",
      "这部外太空动漫□□□□□□□□□□□",
      "你发现了一部外太空动漫□□□□□□□□□□□□□",
      "你发现了一部外太空动漫□□□□□□□",
    ],
    [
      "这款外太空游戏□□□□□□□□□□□□□□□□",
      "这款外太空动漫□□□□□□□□□□□",
      "你发现了一款外太空动漫□□□□□□□□□□",
      "你发现了一款外太空动漫□□□□□□□",
    ],
  ],

  comlainLogTips: [
    "哎呀，不小心举报到了不该举报的人。你的影响力大受打击。",
    "被你举报了。国内漫画行业大受打击，影响力开始下降。",
    "被你举报了。国内动漫行业发展停滞，影响力开始下降。",
    "被你举报了。国内游戏行业一蹶不振，影响力开始下降。",
    "被你举报了。国际漫画行业被重挫，影响力急剧下降。",
    "被你举报了。国际动漫行业回到起点，影响力急剧下降。",
    "被你举报了。国际游戏行业完全崩溃了，影响力急剧下降。",
    "被你举报了。外太空漫画行业在地球的市场全面萎缩，影响力大幅度下降。",
    "被你举报了。外太空动漫行业在地球的市场彻底垮台，影响力大幅度下降。",
    "被你举报了。外太空游戏行业在地球的市场遭遇毁灭性打击，影响大幅度下降。",
  ],

  history: [
    {
      time: Date.UTC(2016, 6, 1),
      log: "从2016年7月1日起，所有的手游都必须要申请版号才能运营。这是一个好的开始，你获得了100点影响力上限。"
    },
    {
      time: Date.UTC(2018, 2, 1),
      log: "从2018年3月1日起，游戏行业停发版号，ACG文化影响力降低当前值的5%，你大受鼓舞！"
    },
    {
      time: Date.UTC(2018, 11, 21),
      log: "从2018年12月21日起，停发了半年多的游戏版号重新开放。你感到有些沮丧。"
    },
    {
      time: Date.UTC(2020, 6, 1),
      log: "所有未获得游戏版号的游戏均将在app store中下架。ACG文化影响力降低当前值的5%，你信心倍增！"
    },
    {
      time: Date.UTC(2021, 7, 30),
      log: "《关于进一步严格管理 切实防止未成年人沉迷网络游戏的通知》要求，严格限制向未成年人提供网络游戏服务的时间，所有网络游戏企业仅可在周五、周六、周日和法定节假日每日20时至21时向未成年人提供1小时服务。ACG文化影响力降低当前值的5%，你大受鼓舞！"
    },

    {
      time: Date.UTC(2021, 8, 24),
      log: "《迪迦奥特曼》《从零开始的异世界生活》《熊出没》等动画片存在大量问题，被全网下架。ACG文化影响力降低当前值的5%，你信心倍增！"
    },
  ]
};

