export const language = {
  startGame: {
    btns: ["为了孩子", "为了拯救人类", "为了感恩"],
    enterTitle: ["你决定彻底消灭ACG文化", "走上一条不被世界理解的道路"],
    enterTitle1: [
      "你在大街上开始拦住路人宣讲、去图书馆演讲……",
      "你大喊消灭ACG暴政，世界属于孩子！",
    ],
    enterTitle2: [
      "大城市ACG文化氛围太浓，垄断的文娱公司和被收买的无良媒体让你四处碰壁",
      "你决定从从农村包围城市，先回到了老家",
    ],
  },

  news: [
    [
      "0级新闻测试1号",
      "0级新闻测试2号",
      "0级新闻测试3号",
      "0级新闻测试4号",
      "0级新闻测试5号",
      "0级新闻测试6号",
      "0级新闻测试7号",
      "0级新闻测试8号",
      "0级新闻测试9号",
      "0级新闻测试10号",
      "0级新闻测试11号",
    ],
    [
      "1级新闻测试1号",
      "1级新闻测试2号",
      "1级新闻测试3号",
      "1级新闻测试4号",
      "1级新闻测试5号",
      "1级新闻测试6号",
    ],
  ],
};
