export const language = {
  startGame: {
    btns: ["为了孩子", "为了拯救人类", "为了感恩"],
    enterTitle: ["你决定彻底消灭ACG文化", "走上一条不被世界理解的道路"],
    enterTitle1: [
      "你在大街上开始拦住路人宣讲、去图书馆演讲……",
      "你大喊消灭ACG暴政，世界属于孩子！",
    ],
    enterTitle2: [
      "大城市ACG文化氛围太浓，垄断的文娱公司和被收买的无良媒体让你四处碰壁",
      "你决定从从农村包围城市，先回到了老家",
    ],
  },

  news: [
    [
      "0级新闻测试1号",
      "0级新闻测试2号",
      "0级新闻测试3号",
      "0级新闻测试4号",
      "0级新闻测试5号",
      "0级新闻测试6号",
      "0级新闻测试7号",
      "0级新闻测试8号",
      "0级新闻测试9号",
      "0级新闻测试10号",
      "0级新闻测试11号",
    ],
    [
      "1级新闻测试1号",
      "1级新闻测试2号",
      "1级新闻测试3号",
      "1级新闻测试4号",
      "1级新闻测试5号",
      "1级新闻测试6号",
    ],
    [
      "2级新闻测试1号2级新闻测试1号2级新闻测试1号2级新闻测试1号",
      "2级新闻测试2号2级新闻测试1号2级新闻测试1号2级新闻测试1号",
      "2级新闻测试3号2级新闻测试1号2级新闻测试1号2级新闻测试1号",
      "2级新闻测试4号2级新闻测试1号2级新闻测试1号2级新闻测试1号2级新闻测试1号2级新闻测试1号2级新闻测试1号",
      "2级新闻测试5号2级新闻测试1号2级新闻测试1号2级新闻测试1号2级新闻测试1号2级新闻测试1号2级新闻测试1号",
      "2级新闻测试6号2级新闻测试1号2级新闻测试1号2级新闻测试1号2级新闻测试1号2级新闻测试1号2级新闻测试1号2级新闻测试1号2级新闻测试1号",
    ],
  ],

  guideTips:[
    "解锁了金钱，金钱主要用于购买各项建筑。",
    "解锁了知识，用于研究。",
    "3解锁了金钱，金钱主要用于购买各项建筑。",
    "4解锁了知识，用于研究。",
    "5解锁了金钱，金钱主要用于购买各项建筑。",
    "6解锁了知识，用于研究。",
    "7解锁了金钱，金钱主要用于购买各项建筑。",
    "8解锁了知识，用于研究。",
    "9解锁了金钱，金钱主要用于购买各项建筑。",
    "10解锁了知识，用于研究。",
  ],

  //举报分类型，0是错误 123国内漫画动漫游戏456国外漫画动漫游戏;789外太空的漫画;9外太空的动漫；10外太空的游戏
  complain:[
    [
      "错误的举报1",
      "错误的举报2",
      "错误的举报3",
      "错误的举报4",
      "错误的举报5",
    ],
    [
      "举报国内漫画1",
      "举报国内漫画2",
      "举报国内漫画3",
      "举报国内漫画4",
      "举报国内漫画5",
    ],
    [
      "举报国内动漫1",
      "举报国内动漫2",
      "举报国内动漫3",
      "举报国内动漫4",
      "举报国内动漫5",
    ],
    [
      "举报国内游戏1",
      "举报国内游戏2",
      "举报国内游戏3",
      "举报国内游戏4",
      "举报国内游戏5",
    ],
    [
      "举报国外漫画1",
      "举报国外漫画2",
      "举报国外漫画3",
      "举报国外漫画4",
      "举报国外漫画5",
    ],
    [
      "举报国外动漫1",
      "举报国外动漫2",
      "举报国外动漫3",
      "举报国外动漫4",
      "举报国外动漫5",
    ],
    [
      "举报国外游戏1",
      "举报国外游戏2",
      "举报国外游戏3",
      "举报国外游戏4",
      "举报国外游戏5",
    ],
    [
      "举报外太空漫画1",
      "举报外太空漫画2",
      "举报外太空漫画3",
      "举报外太空漫画4",
      "举报外太空漫画5",
    ],
    [
      "举报外太空动漫1",
      "举报外太空动漫2",
      "举报外太空动漫3",
      "举报外太空动漫4",
      "举报外太空动漫5",
    ],
    [
      "举报外太空游戏1",
      "举报外太空游戏2",
      "举报外太空游戏3",
      "举报外太空游戏4",
      "举报外太空游戏5",
    ],

  ],

  comlainLogTips:[
    "；  哎呀，不小心举报到了不该举报的人。你的影响力大受打击",
    "；  被你举报了。国内漫画行业大受打击，影响力开始下降",
    "；  被你举报了。国内动漫行业发展停滞，影响力开始下降",
    "；  被你举报了。国内游戏行业一蹶不振，影响力开始下降",
    "；  被你举报了。国际漫画行业被重挫，影响力急剧下降",
    "；  被你举报了。国际动漫行业回到起点，影响力急剧下降",
    "；  被你举报了。国际游戏行业完全崩溃了，影响力急剧下降",
    "；  被你举报了。外太空漫画行业在地球的市场全面萎缩，影响力大幅度下降",
    "；  被你举报了。外太空动漫行业在地球的市场彻底垮台，影响力大幅度下降",
    "；  被你举报了。外太空游戏行业在地球的市场遭遇毁灭性打击，影响大幅度下降",
  ],
};

