export const language = {
  startGame: {
    btns: ["为了孩子", "为了拯救人类", "为了感恩"],
    enterTitle: ["你决定彻底消灭ACG文化", "走上一条不被世界理解的道路"],
    enterTitle1: [
      "你在大街上开始拦住路人宣讲、去图书馆演讲……",
      "你大喊消灭ACG暴政，世界属于孩子！",
    ],
    enterTitle2: [
      "大城市ACG文化氛围太浓，垄断的文娱公司和被收买的无良媒体让你四处碰壁",
      "你决定从从农村包围城市，先回到了老家",
    ],
  },

  news: [
    [
      "0级新闻测试1号",
      "0级新闻测试2号",
      "0级新闻测试3号",
      "0级新闻测试4号",
      "0级新闻测试5号",
      "0级新闻测试6号",
      "0级新闻测试7号",
      "0级新闻测试8号",
      "0级新闻测试9号",
      "0级新闻测试10号",
      "0级新闻测试11号",
    ],
    [
      "1级新闻测试1号",
      "1级新闻测试2号",
      "1级新闻测试3号",
      "1级新闻测试4号",
      "1级新闻测试5号",
      "1级新闻测试6号",
    ],
    [
      "2级新闻测试1号2级新闻测试1号2级新闻测试1号2级新闻测试1号",
      "2级新闻测试2号2级新闻测试1号2级新闻测试1号2级新闻测试1号",
      "2级新闻测试3号2级新闻测试1号2级新闻测试1号2级新闻测试1号",
      "2级新闻测试4号2级新闻测试1号2级新闻测试1号2级新闻测试1号2级新闻测试1号2级新闻测试1号2级新闻测试1号",
      "2级新闻测试5号2级新闻测试1号2级新闻测试1号2级新闻测试1号2级新闻测试1号2级新闻测试1号2级新闻测试1号",
      "2级新闻测试6号2级新闻测试1号2级新闻测试1号2级新闻测试1号2级新闻测试1号2级新闻测试1号2级新闻测试1号2级新闻测试1号2级新闻测试1号",
    ],
  ],

  guideTips:[
    "解锁了金钱，金钱主要用于购买各项建筑以及研究ACG相关的知识。钱不是目的，只是手段，金钱对你来说如同粪土。你只是为了消灭ACG文化才收集了一点点钱。",
    "解锁了动漫知识，这是一种研究资源，在研究分页内，解锁各项研究，加速你消灭ACG的进程。知己知彼百战百胜，我不入地狱谁入地狱。",
    "你解锁了第一个信徒建筑，信徒是一群彻底追随你消灭ACG的助手，会帮你扩大影响力。前往小镇建设心理诊所吧。",
    "信徒的增长比较缓慢，初始不会低于每10秒1个。随着信徒越来越多，由于聚众效应，他们增长的速度也会越快，但信徒的上限受心理诊所的数量限制。安排信徒工作吧，他们将代替你扩大影响力、赚取金钱和研究知识。每名信徒可提供1点影响力、2点金钱或者1点知识的速度（研究知识会消耗2倍的金钱）",
    "你解锁了印刷店，这是一种金钱效率建筑。首先你得有信徒在赚取金钱，它才会生效，每个印刷店会提高10%的赚取金钱效率",
    "你解锁了书店，这是一种研究效率建筑。与印刷店一样，它会提高10%的研究动漫知识的效率",
    "你来到新的电力时代，网瘾治疗中心。他将提供一种新的伪信徒——从众，从众没有信徒虔诚，他们不会主动去消灭ACG文化，但会被动的跟随信徒活动，即从众不会提高你的影响力上限。但你可以安排他们工作，每个从众需要额外消耗1点金钱每秒。从众数量也受到信徒的影响，从众的增长速度和信徒的增长速度一样。当信徒达到上限后，从众将获得两倍的增长速度。",
    "你解锁了游戏知识，这是另一种ACG文化，他的荼毒更深，所以需要深入研究。每1点游戏知识需要消耗10点金钱，且只能通过信徒/从众工作获取。",
    "你解锁了举报功能！举报是一项伟大的发明，将那些看不顺眼的ACG文化通通举报吧！至于对错Who care。",
  ],

  //举报分类型，0是错误 123国内漫画动漫游戏456国外漫画动漫游戏;789外太空的漫画;9外太空的动漫；10外太空的游戏
  complain:[
    [
      "错误的举报1",
      "错误的举报2",
      "错误的举报3",
      "错误的举报4",
      "错误的举报5",
    ],
    [
      "举报国内漫画1",
      "举报国内漫画2",
      "举报国内漫画3",
      "举报国内漫画4",
      "举报国内漫画5",
    ],
    [
      "举报国内动漫1",
      "举报国内动漫2",
      "举报国内动漫3",
      "举报国内动漫4",
      "举报国内动漫5",
    ],
    [
      "举报国内游戏1",
      "举报国内游戏2",
      "举报国内游戏3",
      "举报国内游戏4",
      "举报国内游戏5",
    ],
    [
      "举报国外漫画1",
      "举报国外漫画2",
      "举报国外漫画3",
      "举报国外漫画4",
      "举报国外漫画5",
    ],
    [
      "举报国外动漫1",
      "举报国外动漫2",
      "举报国外动漫3",
      "举报国外动漫4",
      "举报国外动漫5",
    ],
    [
      "举报国外游戏1",
      "举报国外游戏2",
      "举报国外游戏3",
      "举报国外游戏4",
      "举报国外游戏5",
    ],
    [
      "举报外太空漫画1",
      "举报外太空漫画2",
      "举报外太空漫画3",
      "举报外太空漫画4",
      "举报外太空漫画5",
    ],
    [
      "举报外太空动漫1",
      "举报外太空动漫2",
      "举报外太空动漫3",
      "举报外太空动漫4",
      "举报外太空动漫5",
    ],
    [
      "举报外太空游戏1",
      "举报外太空游戏2",
      "举报外太空游戏3",
      "举报外太空游戏4",
      "举报外太空游戏5",
    ],

  ],

  comlainLogTips:[
    "；  哎呀，不小心举报到了不该举报的人。你的影响力大受打击",
    "；  被你举报了。国内漫画行业大受打击，影响力开始下降",
    "；  被你举报了。国内动漫行业发展停滞，影响力开始下降",
    "；  被你举报了。国内游戏行业一蹶不振，影响力开始下降",
    "；  被你举报了。国际漫画行业被重挫，影响力急剧下降",
    "；  被你举报了。国际动漫行业回到起点，影响力急剧下降",
    "；  被你举报了。国际游戏行业完全崩溃了，影响力急剧下降",
    "；  被你举报了。外太空漫画行业在地球的市场全面萎缩，影响力大幅度下降",
    "；  被你举报了。外太空动漫行业在地球的市场彻底垮台，影响力大幅度下降",
    "；  被你举报了。外太空游戏行业在地球的市场遭遇毁灭性打击，影响大幅度下降",
  ],
};

